БухЭксп/Reports/CW_АнализГрузоперевозокПоБюджетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_АнализГрузоперевозокПоБюджетам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресНастроек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ИсторияУтверждениеБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ИсторияУтверждениеБюджетов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыБюджетовПоЗаявкам</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ВерсииБюджетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПризнакУтверждения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Reports/CW_АнализГрузоперевозокПоБюджетам/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПроверитьУтверждениеБюджетаЗаказа(Настройки);
	
	Заказ = Настройки["Заказ"];
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_ИсторияУтверждениеБюджетов.Объект,
	               |	CW_ИсторияУтверждениеБюджетов.ВерсияБюджета,
	               |	CW_ИсторияУтверждениеБюджетов.Период КАК ДатаУтверждения,
	               |	CW_ИсторияУтверждениеБюджетов.ПризнакУтверждения КАК ПризнакУтверждения
	               |ИЗ
	               |	РегистрСведений.CW_ИсторияУтверждениеБюджетов КАК CW_ИсторияУтверждениеБюджетов
	               |ГДЕ
	               |	CW_ИсторияУтверждениеБюджетов.Объект = &Заказ";
				   
	Запрос.УстановитьПараметр("Заказ",Заказ);
	
	тРезультат = Запрос.Выполнить().Выгрузить();
	
	ВерсияБюджетаПлан = ?(Настройки["ВерсияБюджетаПлан"].Пустая(),Справочники.CW_ВерсииБюджетов.Основная		,Настройки["ВерсияБюджетаПлан"]);
	ВерсияБюджетаФакт = ?(Настройки["ВерсияБюджетаФакт"].Пустая(),Константы.CW_БазоваяВерсияБюджета.Получить()	,Настройки["ВерсияБюджетаФакт"]);
	
	Если тРезультат.НайтиСтроки(Новый Структура("Объект,ВерсияБюджета",Заказ,ВерсияБюджетаПлан)).Количество() = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для заказа <" + Заказ.Наименование + " > версия бюджета (план) не утверждена: пересчет валютных сумм будет выполнен на текущую дату!";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	Если тРезультат.НайтиСтроки(Новый Структура("Объект,ВерсияБюджета",Заказ,ВерсияБюджетаФакт)).Количество() = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для заказа <" + Заказ.Наименование + " > версия бюджета (факт) не утверждена: пересчет валютных сумм будет выполнен на текущую дату!";
		Сообщение.Сообщить();
		
	КонецЕсли;
		
	
КонецПроцедуры	

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);	
	// --- 
	
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	
	// установим заголовок
	МетаданныеОтчета = ЭтотОбъект.Метаданные();
	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок",ВРег(МетаданныеОтчета.Синоним));
	
	// Установим параметры
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Грузоперевозки"		,Настройки["Грузоперевозки"]);
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ВерсияБюджетаПлан"	,?(Настройки["ВерсияБюджетаПлан"].Пустая(),Справочники.CW_ВерсииБюджетов.Основная,Настройки["ВерсияБюджетаПлан"]));
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ВерсияБюджетаФакт"	,?(Настройки["ВерсияБюджетаФакт"].Пустая(),Справочники.CW_ВерсииБюджетов.Основная,Настройки["ВерсияБюджетаФакт"]));
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Организация"			,?(Настройки["Организация"].Пустая(),Неопределено,Настройки["Организация"]));
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ФормированиеОтчета"	,Настройки["ФормированиеОтчета"]);
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Валюта"				,Настройки["Валюта"]);
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ТекущаяДата"			,ТекущаяДата());
	
	ПроверитьУтверждениеБюджетаЗаказа(Настройки);
	
КонецПроцедуры

#КонецЕсли
